<details ><summary>plan for ruby-getting-started-terraform 2026-01-03 03:46:06 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.rds_s3_export will be created
  + resource "aws_cloudwatch_event_rule" "rds_s3_export" {
      + arn                 = (known after apply)
      + description         = "For RDS Backup"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "rds-s3-export-rules"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 4 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.rds_s3_export will be created
  + resource "aws_cloudwatch_event_target" "rds_s3_export" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "rds-s3-export-rules"
      + target_id      = "ruby-getting-started-lambda"
    }

  # aws_iam_role_policy.scheduler will be updated in-place
  ~ resource "aws_iam_role_policy" "scheduler" {
        id     = "ruby-getting-started-scheduler-role:ruby-getting-started-scheduler-policy"
        name   = "ruby-getting-started-scheduler-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:StopInstances",
                          - "rds:StopDBInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-northeast-1:786832920677:function:rds_s3_export"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.lambda must be replaced
-/+ resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ap-northeast-1:786832920677:function:rds_s3_export" -> (known after apply)
      ~ function_name                  = "rds_s3_export" -> "rds_s3_export_function" # forces replacement
      ~ id                             = "rds_s3_export" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:786832920677:function:rds_s3_export/invocations" -> (known after apply)
      ~ last_modified                  = "2026-01-02T12:15:09.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:786832920677:function:rds_s3_export:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:786832920677:function:rds_s3_export:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 1217 -> (known after apply)
        tags                           = {
            "Environment" = "production"
            "Name"        = "ruby-getting-started-lambda-role"
            "Project"     = "ruby-getting-started"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_permission.allow_event_bridge will be created
  + resource "aws_lambda_permission" "allow_event_bridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "rds_s3_export_function"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (ruby-getting-started-terraform)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
|  CHANGE  |                  RESOURCE                   |
|----------|---------------------------------------------|
| add      | `aws_cloudwatch_event_rule.rds_s3_export`   |
|          | `aws_cloudwatch_event_target.rds_s3_export` |
|          | `aws_lambda_permission.allow_event_bridge`  |
| update   | `aws_iam_role_policy.scheduler`             |
| recreate | `aws_lambda_function.lambda`                |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p ruby-getting-started-terraform
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>